{
    "version": "https://jsonfeed.org/version/1",
    "title": "Renan LE CARO",
    "description": "",
    "home_page_url": "https://lecaro.me",
    "feed_url": "https://lecaro.me/feed.json",
    "user_comment": "",
    "author": {
        "name": "Renan LE CARO"
    },
    "items": [
        {
            "id": "https://lecaro.me/integrating-remote-services-in-e2e-tests.html",
            "url": "https://lecaro.me/integrating-remote-services-in-e2e-tests.html",
            "title": "Integrating remote services in e2e tests",
            "summary": "Ciboulette.net has a large battery of tests that ensure I don't break too many things when doing a deployment. The app also connects together many services, like google maps, google custom search, Stripe and Sumup. I wanted to make sure those integrations would keep working,&hellip;",
            "content_html": "<p>Ciboulette.net has a large battery of tests that ensure I don't break too many things when doing a deployment. The app also connects together many services, like google maps, google custom search, Stripe and Sumup.</p>\n<p>I wanted to make sure those integrations would keep working, so i embedded the real services in my test. For example, playwright would attempt to connect to a test account at sumup when running the e2e test.</p>\n<p>Recently, sumup changed their login flow, and added a captcha. I don't see how I can work around this. The tests are a bit flaky for a few other reasons anyway, so i think i'll just run them by hand and complete the captcha every time.</p>\n<p>Still, i'm sure there's a better way. I tried to just copy the result of the authentication request but this only worked for a single run of the tests. During the next run Sumup would refuse them for some reason.  </p>",
            "author": {
                "name": "Renan LE CARO"
            },
            "tags": [
            ],
            "date_published": "2023-01-24T08:47:38+01:00",
            "date_modified": "2023-01-24T08:47:38+01:00"
        },
        {
            "id": "https://lecaro.me/android-and-my-grandma.html",
            "url": "https://lecaro.me/android-and-my-grandma.html",
            "title": "Android and my grandma",
            "summary": "I've seen my grandma last weekend and it was yet another reminder of how non intuitive technology can be. Whats-app asked her to rate a call she just had, and she was confused by it. She tried to read the message i sent her, but&hellip;",
            "content_html": "<p>I've seen my grandma last weekend and it was yet another reminder of how non intuitive technology can be. Whats-app asked her to rate a call she just had, and she was confused by it. She tried to read the message i sent her, but clicked my photo instead of my name, and therefore ended up on my profile instead of our conversations.</p>\n<p>Our modern UIs really assume that the user will guess so many things. It's a bit of a shame. I think many grandma should be employed as usability testers for apps. We'd all get better software. </p>\n<p> </p>",
            "author": {
                "name": "Renan LE CARO"
            },
            "tags": [
            ],
            "date_published": "2023-01-23T16:05:06+01:00",
            "date_modified": "2023-01-23T16:05:06+01:00"
        },
        {
            "id": "https://lecaro.me/summary-of-2022.html",
            "url": "https://lecaro.me/summary-of-2022.html",
            "title": "A small collaborative city builder",
            "summary": "In 2022 in got a new job at Della AI and moved to Nantes. I focused less on ciboulette.net than before, and had less time for side project. Working at Della has been interesting. I took over a React fronted (with Redux that i'm slowly&hellip;",
            "content_html": "<p>In 2022 in got a new job at <a href=\"https://dellalegal.com\">Della AI</a> and moved to Nantes. I focused less on ciboulette.net than before, and had less time for side project. </p>\n<p>Working at Della has been interesting. I took over a React fronted (with Redux that i'm slowly getting rid of). I had to learn typescript, but in the end I don't fully exploit it. It helps avoid mistakes, but also forces you to write code that looks more like java than proper Javascript. I had never seen so many enums in a codebase. </p>\n<p>Anyway, I'm quite happy with the way things are going, and our company has been bought out by a bigger one, Legisway. I visited their offices and they are neat !</p>\n<p>On the hacking side, over the Christmas/New year vacations I started a small game project. It's a chilled out city builder, made in web tech. You can have a look at it here : <a href=\"https://drmp.lecaro.me/\">https://drmp.lecaro.me/</a> (there's no good name for it yet). </p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://lecaro.me/media/posts/29/drmp-screenshot\" alt=\"screenshot of the game\" width=\"1918\" height=\"916\"></figure>\n<p>That's all for today, I had to dig up this website from an old save to publish something new on my new computer. </p>\n<p> </p>",
            "author": {
                "name": "Renan LE CARO"
            },
            "tags": [
            ],
            "date_published": "2023-01-20T19:54:40+01:00",
            "date_modified": "2023-01-20T20:02:21+01:00"
        },
        {
            "id": "https://lecaro.me/picnic-end-to-end-encrypted-collaborative-text-editor.html",
            "url": "https://lecaro.me/picnic-end-to-end-encrypted-collaborative-text-editor.html",
            "title": "Picnic: end-to-end encrypted collaborative text editor",
            "summary": "I felt like having a small break from my main project this month, so I'm giving myself some weeks to try out other ideas I've been putting off. Just happy coding of open source MVPs for various ideas I've had for a while. I'm giving&hellip;",
            "content_html": "<p>I felt like having a small break from <a href=\"https://ciboulette.net/\">my main project</a> this month, so I'm giving myself <strong>some weeks to try out other ideas</strong> I've been putting off. Just happy coding of open source MVPs for various ideas I've had for a while. I'm giving myself a <strong>max of 7 days per app</strong> to make sure the scope stays reasonable.</p>\n<p>The first one is pretty close to done now, and it's called <a href=\"https://picnic.lecaro.me/\">picnic</a>.</p>\n<p>It's a simple web app that lets you <strong>create a plain text document and edit it with friends in real time</strong> (on PC and smartphone).</p>\n<p>It's <strong>end-to-end encrypted</strong>, so the client side does the encryption with window.crypto (despite not really adding much security) and sends that to my node server over web sockets. The server saves that document and forwards it to the other clients that can decode it thanks to the key stored in the URL. \"<strong>Rolling your own crypto</strong>\" is generally a bad idea, but I think here i'm \"using pre-made crypto\" which is alright, despite a very strong feeling on \"I have no idea what I'm doing\".</p>\n<p>Speaking of haphazardly reaching a decent solution <strong>: syncing edits is hard</strong>. When you type some words in the text, the full value of that text is sent over to the server, who forwards it to everyone as-is. So <strong>each client receives the latest version</strong>, but might have done its own edits that are not yet sent for syncing (two people typing at the same time).</p>\n<p>I end up doing a <strong>three-way merge of full text</strong>, using a homemade, quite naive approach. It works  most of the time, though it quite easily gets confused. Initially, just typing alone on the document would get super messy when the updates from the server would conflict with your local edits.</p>\n<p>My 3 way merge algorithm <strong>performs well when the edits are far from each other</strong>, but it <strong>performs terribly when two users are adding a thing at the same spot</strong> in the doc. Luckily, this only really happen when a user tries to apply his own edits. So I just made the editor ignore any edits that came from itself (using a session ID that only lasts for the duration of the web page). </p>\n<p>Furthermore, some <strong>edits would</strong> <strong>arrive in the wrong order</strong>, and my algorithm would consider a <strong>reversed addition as a deletion</strong>. I could solve that quite easily too, by just <strong>adding a version number to each document</strong>, incrementing it at each edit, and ignoring stale edits. The server keeps the authoritative value for the current version number and blocks any stale edit form propagating. </p>\n<p>Finally, the app <strong>reconnects</strong> with exponential back-off and <strong>retries</strong> to send user's edits whenever the sync fails for any reason, until it's up-to-date with the server. Overall, I'm <strong>quite pleased with the result</strong>, it's usable, loads fast and more reliable than <a href=\"https://txt.lecaro.me/\">my previous attempt</a> at solving the same project. It's also quite easy to self-host as the DB is simply the local file system.</p>\n<p> </p>",
            "author": {
                "name": "Renan LE CARO"
            },
            "tags": [
            ],
            "date_published": "2022-01-10T23:27:39+01:00",
            "date_modified": "2022-01-10T23:31:26+01:00"
        },
        {
            "id": "https://lecaro.me/i3-three-finger-workspace-swipe-on-ubuntu.html",
            "url": "https://lecaro.me/i3-three-finger-workspace-swipe-on-ubuntu.html",
            "title": "i3 three finger workspace swipe on Ubuntu  ",
            "summary": "I travel a lot and try to carry as little stuff as possible. However, having a second screen is a productivity booster when programming, so i'm carrying a small no-name 15\" screen with me. I was looking for a way to get the productivity boost&hellip;",
            "content_html": "<p>I travel a lot and try to carry as little stuff as possible. However, having a second screen is a productivity booster when programming, so i'm carrying a <a href=\"https://fr.aliexpress.com/item/1005002090199185.html\" target=\"_blank\" rel=\"noopener noreferrer\">small no-name 15\" screen</a> with me. </p>\n<p>I was looking for a way to get the productivity boost of a second screen without the extra bulk. I first thought of getting a<a href=\"https://fr.aliexpress.com/item/32972011831.html\" target=\"_blank\" rel=\"noopener noreferrer\"> foot pedal</a> to switch i3 workspaces \"without thinking\".</p>\n<p>However, after discussing with a friend that's on a mac, I realised that a good first step would be to set up <strong>touchpad swipe gestures</strong> for<strong> workspace swiping</strong>.</p>\n<p>Here's how I got it working on Ubuntu 20.04:</p>\n<p>Add yourself to the \"input\" group </p>\n<pre><code>sudo gpasswd -a $USER input</code></pre>\n<p><strong>Reboot your computer</strong> (required)</p>\n<p>Then install the gesture detection script</p>\n<pre>sudo apt-get install wmctrl xdotool libinput-tools<br>git clone https://github.com/bulletmark/libinput-gestures.git<br>cd libinput-gestures<br>sudo make install</pre>\n<p>Configure the swipe gestures : </p>\n<pre>printf \"gesture swipe left 3 i3-msg workspace prev\\ngesture swipe right 3  i3-msg workspace next\\n\" &gt; ~/.config/libinput-gestures.conf</pre>\n<p>Start the script </p>\n<pre>libinput-gestures-setup autostart start</pre>\n<p>Try swiping left / right on your touchpad with tree fingers, it should switch workspaces. </p>\n<p>For mode details, see the script documentation here (not my own) : <a href=\"https://github.com/bulletmark/libinput-gestures\" target=\"_blank\" rel=\"noopener noreferrer\">https://github.com/bulletmark/libinput-gestures</a></p>\n<p> </p>\n<p> </p>\n<p> </p>",
            "author": {
                "name": "Renan LE CARO"
            },
            "tags": [
            ],
            "date_published": "2021-10-29T17:02:13+02:00",
            "date_modified": "2021-10-29T17:07:35+02:00"
        },
        {
            "id": "https://lecaro.me/one-liner-to-watch-the-current-folder-and-tree-its-structure.html",
            "url": "https://lecaro.me/one-liner-to-watch-the-current-folder-and-tree-its-structure.html",
            "title": "One liner to watch the current folder and tree its structure",
            "summary": "I've been working with smstools3 which uses a folder and its subfolder as its state store. Instead of running \"tree\" manually in the /var/spool/sms folder, i'd rather have it be done automagically whenever the files change. I've used inotifywait for that, which needs to be&hellip;",
            "content_html": "<p>I've been working with smstools3 which uses a folder and its subfolder as its state store. </p>\n<p>Instead of running \"tree\" manually in the /var/spool/sms folder, i'd rather have it be done automagically whenever the files change.</p>\n<p>I've used <strong>inotifywait </strong>for that, which needs to be installed on ubuntu with <strong>sudo apt install inotify-tools</strong> .</p>\n<p>Then it's just a matter of cd-ing to the proper directory and running :</p>\n<p><strong>clear &amp;&amp; tree &amp;&amp; inotifywait --monitor --quiet --recursive --event modify . | while read; do clear; tree; done</strong></p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://lecaro.me/media/posts/25/inotify-result.png\" alt=\"Screenshot of the result, it will refresh whenever files change\" width=\"409\" height=\"348\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://lecaro.me/media/posts/25/responsive/inotify-result-xs.png 300w ,https://lecaro.me/media/posts/25/responsive/inotify-result-sm.png 480w ,https://lecaro.me/media/posts/25/responsive/inotify-result-md.png 768w ,https://lecaro.me/media/posts/25/responsive/inotify-result-lg.png 1024w ,https://lecaro.me/media/posts/25/responsive/inotify-result-xl.png 1360w ,https://lecaro.me/media/posts/25/responsive/inotify-result-2xl.png 1600w\">\n<figcaption >Result</figcaption>\n</figure>\n<p> </p>",
            "author": {
                "name": "Renan LE CARO"
            },
            "tags": [
            ],
            "date_published": "2021-07-05T17:39:41+02:00",
            "date_modified": "2021-07-05T17:39:41+02:00"
        },
        {
            "id": "https://lecaro.me/youtube-music-is-terrible.html",
            "url": "https://lecaro.me/youtube-music-is-terrible.html",
            "title": "Youtube music is Meh",
            "summary": "Spotify was a bit buggy on my laptop a while ago so I stopped my premium plan. I used the excellent soundiiz to transfer my playlists over to youtube (in small 200 tracks batches), where I had a premium account. The thing is, youtube music&hellip;",
            "content_html": "<p>Spotify was a bit buggy on my laptop a while ago so I stopped my premium plan.</p>\n<p>I used the excellent <a href=\"https://soundiiz.com\">soundiiz</a> to transfer my playlists over to youtube (in small 200 tracks batches), where I had a premium account.</p>\n<p>The thing is, youtube music uses the videos as audio source, and artists often add noise to the video clips to make the \"listen for free\" youtube experience inferior to buying a cd.</p>\n<p>And I end up paying to listen to this crap. </p>\n<p>Edit : the \"mix\" feature tends to mostly play songs that are \"clean\". It's more my imported likes that have the added noise.</p>\n<p>I actually kind of like what youtube is auto playing, and I've discovered a few good new tracks. For the price I pay (~3€/month, i'm still on a Russian plan =D ) I'd say the service quality is fair. </p>\n<p> </p>\n<p> </p>",
            "author": {
                "name": "Renan LE CARO"
            },
            "tags": [
            ],
            "date_published": "2021-05-07T12:08:50+02:00",
            "date_modified": "2021-07-06T09:55:20+02:00"
        },
        {
            "id": "https://lecaro.me/github-action-to-deploy-a-meteor-app-to-digital-ocean.html",
            "url": "https://lecaro.me/github-action-to-deploy-a-meteor-app-to-digital-ocean.html",
            "title": "Github action to deploy a meteor app to digital ocean ",
            "summary": "Why no galaxy ? My main app (https://ciboulette.net) is a meteor app. I love meteor, and I'm glad it's recently received some new funding and new updates. However, the official way to host a meteor app, meteor galaxy, is super expensive for a small indie&hellip;",
            "content_html": "<h2>Why no galaxy ? </h2>\n<p>My main app (<a href=\"https://ciboulette.net\">https://ciboulette.net</a>) is a meteor app. I love meteor, and I'm glad it's recently received some new funding and new updates. </p>\n<p>However, the official way to host a meteor app, meteor galaxy, is super expensive for a small indie project. I can understand that server costs are usually not significant, but if i can get away with 15$ a month instead of 115$ well rather do that.</p>\n<p>Of course if I had to pay someone 100$/hour to manage my servers, it would be a different story.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://lecaro.me/media/posts/23/comparison.png\" alt=\"Meteor and digital ocean pricing side by side\" width=\"1910\" height=\"795\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://lecaro.me/media/posts/23/responsive/comparison-xs.png 300w ,https://lecaro.me/media/posts/23/responsive/comparison-sm.png 480w ,https://lecaro.me/media/posts/23/responsive/comparison-md.png 768w ,https://lecaro.me/media/posts/23/responsive/comparison-lg.png 1024w ,https://lecaro.me/media/posts/23/responsive/comparison-xl.png 1360w ,https://lecaro.me/media/posts/23/responsive/comparison-2xl.png 1600w\"></figure>\n<p>Anyway, i'm really happy with my meteor up + digital ocean setup, but the deploys take forever when you have a bad DSL connection (0.8 MB/s upload, whoo) so I looked for a way to get my deploys to happen in the cloud.</p>\n<p>The cheapest (free) and simplest solution I found was github actions.</p>\n<p>Here's the github action for one of my open source repositories : <a href=\"https://github.com/renanlecaro/simpletextnet/blob/master/.github/workflows/main.yml\">https://github.com/renanlecaro/simpletextnet/blob/master/.github/workflows/main.yml</a></p>\n<p>The idea is :</p>\n<ul>\n<li>Get \"mup deploy\" working locally</li>\n<li>Add the required ssh keys to the github action runner as secrets</li>\n<li> Run mup deploy from the runner</li>\n</ul>\n<p>It's not rocket science, really, it was just not as straighforward as I hoped it would be. </p>\n<p>Below, the main action code</p>\n<pre>name: Deploy meteor app to digital ocean with meteor up<br>on:<br>  push:<br>    branches: [ master ]<br>  workflow_dispatch:<br><br>jobs:<br>  build:<br>    runs-on: ubuntu-latest<br>    steps:<br><br>      # we setup ssh first as it is quick, so the action will fail <br>      # fast during the installation on a new repository<br>      - name: Install SSH key<br>        uses: shimataro/ssh-key-action@v2<br>        with:<br>          key: ${{ secrets.SSH_KEY }}<br>          known_hosts: ${{ secrets.KNOWN_HOSTS }}<br><br>      # just a dummy request to check the communication with the server<br>      # is ok, we'll upload after building<br>      - name: Test ssh key to fail fast<br>        run: ssh root@188.166.160.106 -t \"pwd\"<br><br>      # get the source<br>      - uses: actions/checkout@v2<br><br>      # install only the production dependencies<br>      - name: get production dependencies only<br>        run: npm install --production<br><br>      # install mup without the -g flag <br>      - name: install mup locally<br>        run: npm install mup<br><br>      # install meteor to be able to build the app as a bundle<br>      - name: install meteor<br>        run: curl https://install.meteor.com/ | sh<br><br>      # upload the bundle. Here, the .production folder is app specific.<br>      # You need to get to the folder with your mup.js file.<br>      - name: Bundle the app and upload to Digital Ocean<br>        run: cd ./.production &amp;&amp; npx mup deploy</pre>",
            "author": {
                "name": "Renan LE CARO"
            },
            "tags": [
            ],
            "date_published": "2021-04-02T16:33:12+02:00",
            "date_modified": "2021-04-02T16:33:12+02:00"
        },
        {
            "id": "https://lecaro.me/github-action-to-check-for-todos-and-fixmes.html",
            "url": "https://lecaro.me/github-action-to-check-for-todos-and-fixmes.html",
            "title": "Github action to check for TODOs and FIXMEs",
            "summary": "I had some TODO and FIXME instructions in random locations in my code that served no purpose, as I was never looking for them. I also use \"console.log\" for temporary debug logs that should be removed in production. I sometimes forget some console.log statements, and&hellip;",
            "content_html": "<p>I had some TODO and FIXME instructions in random locations in my code that served no purpose, as I was never looking for them. I also use \"console.log\" for temporary debug logs that should be removed in production. </p>\n<p>I sometimes forget some console.log statements, and basically always ignore the TODO/FIXME comments. </p>\n<p>So i made a very simple script that fails if there are TODOs, FIXMEs or console.log in your code. This way the PR won't look like it's passing if it's missing an important part.</p>\n<p>Save it in .github/workflows/check_todos.yml</p>\n<pre>name: Look for todos and fixmes<br>on:<br>  pull_request:<br>    branches:<br>      - master<br>jobs:<br>  build:<br>    runs-on: ubuntu-latest<br>    steps:<br>      - uses: actions/checkout@v2<br>      - run: |<br>         if grep --exclude-dir={.git,.github} -rE \"TODO|FIXME|console\\.log\"; then<br>              exit 1<br>         else<br>             echo \"All good\"<br>         fi<br><br></pre>\n<p>I exclude .git because it could contain the text. And I exclude .github so that the regex doesn't match itself. Package files should not be a problem as the script doesn't pull any external dependencies (no npm install)  </p>\n<p>The search is case sensitive, so it will only trip for clear TODOs and not some random method names.</p>\n<p>You get the results really quickly, and because only the source is checked out ,all the generated files/packages should be excluded from the search.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://lecaro.me/media/posts/21/Screenshot-from-2021-03-29-01-16-12.png\" alt=\"Screenshot of a failed build\" width=\"989\" height=\"386\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://lecaro.me/media/posts/21/responsive/Screenshot-from-2021-03-29-01-16-12-xs.png 300w ,https://lecaro.me/media/posts/21/responsive/Screenshot-from-2021-03-29-01-16-12-sm.png 480w ,https://lecaro.me/media/posts/21/responsive/Screenshot-from-2021-03-29-01-16-12-md.png 768w ,https://lecaro.me/media/posts/21/responsive/Screenshot-from-2021-03-29-01-16-12-lg.png 1024w ,https://lecaro.me/media/posts/21/responsive/Screenshot-from-2021-03-29-01-16-12-xl.png 1360w ,https://lecaro.me/media/posts/21/responsive/Screenshot-from-2021-03-29-01-16-12-2xl.png 1600w\"></figure>",
            "author": {
                "name": "Renan LE CARO"
            },
            "tags": [
            ],
            "date_published": "2021-03-27T13:24:50+01:00",
            "date_modified": "2021-03-29T01:16:37+02:00"
        },
        {
            "id": "https://lecaro.me/configuring-i3-for-headful-e2e-tests.html",
            "url": "https://lecaro.me/configuring-i3-for-headful-e2e-tests.html",
            "title": "Configuring i3 for headful e2e tests",
            "summary": "i3 is nice. End to end tests are nice. Chromium is nice. But they don't get along so well by default. When you run you e2e script with nodemon, each run opens and closes the test browser window. By default, that window appears right by&hellip;",
            "content_html": "<p>i3 is nice. End to end tests are nice. Chromium is nice. But they don't get along so well by default.</p>\n<p>When you run you e2e script with nodemon, <strong>each run opens and closes the test browser</strong> window. By default, that window appears <strong>right by your editor</strong>, messing the layout.</p>\n<p>It's easy to fix though : you just need to <strong>tell i3 what to do with that test browser window</strong>.</p>\n<p>To make every new chromium window appear in the workspace $ws5, add this in ~/.config/i3/config</p>\n<p><code>assign [class=\"Chromium-browser\"] → $ws5</code></p>\n<p>The workspace name is a variable here, but you can put anything. I assign that window to a rarely used workspace. </p>\n<p>Chromium has a different class from Google Chrome, so this has no impact on where the \"real\" browser is started.</p>\n<p>To get the class infos for other browsers, run <code>xprop</code> in a terminal and then click on a window.  </p>",
            "author": {
                "name": "Renan LE CARO"
            },
            "tags": [
            ],
            "date_published": "2021-03-27T11:52:52+01:00",
            "date_modified": "2021-03-27T11:52:52+01:00"
        }
    ]
}
