{
    "version": "https://jsonfeed.org/version/1",
    "title": "Renan LE CARO",
    "description": "",
    "home_page_url": "https://renanlecaro.github.io",
    "feed_url": "https://renanlecaro.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "Renan LE CARO"
    },
    "items": [
        {
            "id": "https://renanlecaro.github.io/documenting-systems.html",
            "url": "https://renanlecaro.github.io/documenting-systems.html",
            "title": "Documenting systems",
            "summary": "Back when I was working at virtualQ, I had to do some documentation. At first I didn't quite enjoy it, feeling like this was a chore. But documenting a system can be a very interesting task. I also had to explain our systems to new&hellip;",
            "content_html": "<p>Back when I was working at virtualQ, I had to do some documentation. At first I didn't quite enjoy it, feeling like this was a chore. But <strong>documenting a system can be a very interesting task</strong>. I also had to explain our systems to new hires after we raised some funds and quickly grew the team. </p>\n<p>We had a <strong>documentation website for our API</strong>, based on markdown. It was very technical, with manually copy pasted sample API responses. It wasn't very visual. It had endpoints documented publicly while they were only for internal use. It had a lot of outdated content, and felt more like a patchwork of data bits than a comprehensible thing.</p>\n<p>My fist step was to <strong>remove the documentation off irrelevant endpoints</strong>. The docs were kind of an hybrid between a public api documentation and some internal guide for new hires. I made dedicated to customers trying to use our api only.</p>\n<p>It still had a<strong> \"wall of text\" feeling though</strong>. To make it more palatable, I tried to add visuals. Integrating <a href=\"https://mermaidjs.github.io/\">mermaid</a> to the docs was quite easy, I styled it roughly with some css rules. <strong>Sequence diagrams are awesome</strong>. I used them to communicate the different workflow we had and some typical scenarios the clients would like to use our API for. </p>\n<p>We had a <strong>complex state machine</strong> that tracks the state of a caller through our system. I tried to <strong>represent it as a graph</strong>, but that was a bit too cluttered, so i split it in two graphs and removed some of the transitions that were not normally happening. </p>\n<p>Finally, I wanted to fix our <strong>outdated sample API requests and responses</strong>. Our API was evolving rapidly and having outdated samples was more confusing than helpful. I created a <strong>tiny script that curl commands and update the API answer samples</strong> with them. I had to do some dirty grepping on the answers to replace dates, ids, etc .. to avoid polluting the git log with meaningless edits every time we'd refresh the samples.</p>\n<p>We deployed the new version of the documentation. Some of our new hires still had some use for the old version (that documented more endpoints) so we added a link to it. <strong>We don't have any tracking on the docs website</strong>, so I have no idea what the readership is, but it was great as a learning experience.</p>\n<p>It made me love mermaidJS so much, that I eventually ended up building a <a href=\"https://renanlecaro.github.io/mermaid-gdocs/\">google docs addon</a> for it. </p>\n<p>I like the idea of <strong>writing tutorials as markdown, with E2E test instructions mixed in</strong>, and outputting the result (text, screenshots, response samples) as a document. It would guarantee that the tutorials stay in sync with the product and don't become outdated, with always fresh screenshots. It would make the task of writing E2E tests for some web app a dual purpose task, where you'd <strong>generate both a helpful document and some smoke tests</strong> in one go. </p>\n<p> </p>\n<p> </p>",
            "author": {
                "name": "Renan LE CARO"
            },
            "tags": [
                   "Programming"
            ],
            "date_published": "2020-05-30T11:00:03+10:00",
            "date_modified": "2020-05-30T11:00:13+10:00"
        },
        {
            "id": "https://renanlecaro.github.io/ciboulettenet-a-web-platform-for-vegetable-farmers.html",
            "url": "https://renanlecaro.github.io/ciboulettenet-a-web-platform-for-vegetable-farmers.html",
            "title": "Ciboulette.net : produces email marketing ",
            "summary": "It all started about 7 years ago. My mother got laid off and had to find a job. She already had a large garden and decided to make a living selling vegetables. She invested little capital as the activity was supposed to last only a&hellip;",
            "content_html": "<p>It all started about 7 years ago. </p>\n<p>My mother got laid off and had to find a job. She already had a large garden and decided to <strong>make a living selling vegetables</strong>. She invested little capital as the activity was supposed to last only a few years until retirement. </p>\n<p>Therefore the production was small. Like, very small. She <strong>tried selling at the local market</strong> but you need large volumes to make the trip worth it. Clients always leave the last vegetables left in each box, they don't want to take the last few tomatoes. Turns out, those tomatoes were just the only ones she had at first.</p>\n<p>So she decided to try another sales channel : <strong>she would sell vegetables by email</strong>. Each week, she'd send a list of all the produces that were available in the garden. The clients (mostly friends and acquaintances at first) were free to order by simply replying to the email with what they wanted. At the end of the week, she'd prepare each order and clients would come to the farm to pick up their order. They would pay directly on location.</p>\n<p>Preparing orders for clients is <strong>a lot of extra work</strong>, taking orders is also quite a process, and the whole thing was a bit inefficient, but she did manage to sell vegetables. </p>\n<p>I was a student at the time at university and needed a project for a university class. With a few friends we decided to start a project that'd <strong>automate most of the process</strong> of offering products and taking orders.</p>\n<p>The business model was to create a great app for my mother, and sell it to other farmers later on as a SAAS.</p>\n<p>The first iteration was based on AngularJS, mongo, express. It was hosted on heroku. The second iteration was based on <strong>meteor</strong> with everything real time. This is the <strong>version that's still running today</strong>.</p>\n<p>The project has been running for many years. The farmer's contribution (14.90€/month) pays for the server, but with only 8 users the app is <strong>barely generating a tiny profit</strong>. I could, in theory, get a lot more users, the response to my cold calls was excellent.</p>\n<blockquote>\n<p>But this project taught me something : being responsible for a professional tool that can crash at any moment is no fun.</p>\n</blockquote>\n<p>The risk of the app crashing, the emails ending in spam, the reminder SMSs failing, etc .. is quite high, and the impact is that farmers can end up blocked in their work, and lose sales. </p>\n<p>Today, i tend to <strong>prefer creating completely free side projects</strong>, because it stresses me less to have a program crash if said program is free to use. It's also forcing me to create very lean applications that tend to be <strong>frontend only</strong>. Therefore, they can be hosted for free indefinitely. </p>\n<p>I'm still interested in the SAAS model, but I now keep in mind that <strong>being on call 24/7 limits you freedom</strong>. I live in Russia now, and would love to spend two weeks in the Trans-Siberian. But that's mean spending two weeks doing support from a train in the middle of nowhere. That's a no-go.   </p>\n<p>So, next time, I'll think a bit more before creating a product people will rely on. </p>\n<p> </p>",
            "author": {
                "name": "Renan LE CARO"
            },
            "tags": [
                   "Programming"
            ],
            "date_published": "2020-05-28T11:26:10+10:00",
            "date_modified": "2020-05-30T10:34:03+10:00"
        },
        {
            "id": "https://renanlecaro.github.io/the-fefu-campus.html",
            "url": "https://renanlecaro.github.io/the-fefu-campus.html",
            "title": "The FEFU Campus",
            "summary": "This is really just an excuse to try displaying a few photos in Publii",
            "content_html": "<p>This is really just an excuse to try displaying a few photos in Publii</p>\n<div class=\"gallery gallery-wrapper--wide\"   >\n<figure class=\"gallery__item\"><a href=\"https://renanlecaro.github.io/media/posts/5/gallery/DSC_3034-1.jpg\" ><img src=\"https://renanlecaro.github.io/media/posts/5/gallery/DSC_3034-1-thumbnail.jpg\" alt=\"The bridge to the island\" width=\"720\" height=\"478\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://renanlecaro.github.io/media/posts/5/gallery/DSC_3026-1.jpg\" ><img src=\"https://renanlecaro.github.io/media/posts/5/gallery/DSC_3026-1-thumbnail.jpg\" alt=\"Reflections of the campus in the sea\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://renanlecaro.github.io/media/posts/5/gallery/DSC_3048.jpg\" ><img src=\"https://renanlecaro.github.io/media/posts/5/gallery/DSC_3048-thumbnail.jpg\" alt=\"Campus building, they were lit by two different light sources, but I accentuated that quite a bit\" width=\"720\" height=\"478\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://renanlecaro.github.io/media/posts/5/gallery/DSC_3042.jpg\" ><img src=\"https://renanlecaro.github.io/media/posts/5/gallery/DSC_3042-thumbnail.jpg\" alt=\"Construction site for the new university buildings\" width=\"720\" height=\"720\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://renanlecaro.github.io/media/posts/5/gallery/DSC_3024.jpg\" ><img src=\"https://renanlecaro.github.io/media/posts/5/gallery/DSC_3024-thumbnail.jpg\" alt=\"Another view of the bridge\" width=\"720\" height=\"720\"></a></figure>\n</div>",
            "author": {
                "name": "Renan LE CARO"
            },
            "tags": [
                   "Photography"
            ],
            "date_published": "2020-05-27T23:12:18+10:00",
            "date_modified": "2020-05-27T23:35:29+10:00"
        },
        {
            "id": "https://renanlecaro.github.io/giving-publii-a-try.html",
            "url": "https://renanlecaro.github.io/giving-publii-a-try.html",
            "title": "Giving Publii a try ",
            "summary": "As a web developer, I've created some websites for family and friends. My default tool for that was WordPress, because you could easily set them up, pick a theme, mess with the CSS a bit and let them write the content. But hosting a wordpress&hellip;",
            "content_html": "<p>As a web developer, I've created some websites for family and friends. My default tool for that was WordPress, because you could easily set them up, pick a theme, mess with the CSS a bit and let them write the content.</p>\n<p>But hosting a wordpress website is always a trade-off between reliability and costs. On one side you have free hosts giving you a terrible VM that can barely handle the administration side, on the other overpriced plans for what's really a tiny website with usually almost no traffic. </p>\n<blockquote>\n<p>I've always thought that WordPress was using a tank to kill a fly.</p>\n</blockquote>\n<p>So until now, for non technical business owners, I've set up a free host and the administration of the website was usually quite slow and unreliable. If the client wanted something more reliable, I'd get a paid hosting plan, but that would include some overhead for me. </p>\n<p>For my personal projects I personally used custom made static websites, with or without automatic generation. But I didn't see myself explaining the details of git push, markdown and CLI use to my parents. I thought I should work on an ideal, user friendly static website editor one of those days.  </p>\n<p>Today i discovered <a href=\"https://getpublii.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Publii</a> and thought i'd give it a try for my blog. If it's satisfactory, I might recommend it to my less tech-savvy friends in the future. Until now I've been pleasantly surprised. </p>",
            "author": {
                "name": "Renan LE CARO"
            },
            "tags": [
                   "Programming"
            ],
            "date_published": "2020-05-27T22:49:46+10:00",
            "date_modified": "2020-05-28T10:51:29+10:00"
        },
        {
            "id": "https://renanlecaro.github.io/minimage-minimal-image-editor.html",
            "url": "https://renanlecaro.github.io/minimage-minimal-image-editor.html",
            "title": "Minimage : minimal image editor",
            "summary": "This was one of my first project with the main focus on page size and bundle size. After learning a bit more about Webpack at virtualQ, i wanted to see how small a modern we app could be. The main problem I was trying to&hellip;",
            "content_html": "<p>This was one of my first project with the main focus on page size and bundle size. After learning a bit more about Webpack at virtualQ, i wanted to see how small a modern we app could be.</p>\n<p>The main problem I was trying to solve was a personal one : I wanted to annotate a screenshot of an app to a friend before sending it to him. All i needed was to draw an arrow on a small picture. I couldn't find an app that would only do that, so I created one using the technology I knew best : front end javascript.</p>\n<p><a href=\"https://renanlecaro.github.io/minimage/\">The app</a> is far from perfect, but it runs quite smoothly on a variety of platforms.  </p>\n<p>The app is freely accessible and open source but I haven't really worked on promoting it. Since then i've bought a new phone and don't really need as much to save space on the internal memory. I rarely make use of minimage but keep it online, just in case it might be useful one day.  </p>\n<p> </p>\n<p><img class=\"post__image align-center\" src=\"https://renanlecaro.github.io/media/posts/3/minimage-2.png\" alt=\"Screenshot of minimage\" width=\"565\" height=\"321\"></p>",
            "author": {
                "name": "Renan LE CARO"
            },
            "tags": [
                   "Programming"
            ],
            "date_published": "2020-05-27T22:42:26+10:00",
            "date_modified": "2020-05-27T23:35:16+10:00"
        }
    ]
}
